#pragma once
#include <cstdint>
#include "Common/cmn_typedef.h"
#include <memory>
#include "Common/cmn_hashex.h"

enum BBS_COMMAND_ID {
	ID_ActionBegin = 0,
	ID_ActionEnd = 1,
	ID_CellBegin = 2,
	ID_CellEnd = 3,
	ID_IfBegin = 4,
	ID_IfEnd = 5,
	ID_IfBeginOP2 = 6,
	ID_IfBeginNot = 7,
	ID_IfBeginEnemyName = 8,
	ID_ElseBegin = 9,
	ID_ElseEnd = 10,
	ID_Label = 11,
	ID_Goto = 12,
	ID_GotoIfOP2 = 13,
	ID_ReqGoto = 14,
	ID_FuncBegin = 15,
	ID_FuncEnd = 16,
	ID_FuncCall = 17,
	ID_ReqActionEnd = 18,
	ID_DeleteObject = 19,
	ID_Suicide = 20,
	ID_InterruptBegin = 21,
	ID_InterruptEnd = 22,
	ID_ClearInterrupt = 23,
	ID_GotoIf = 24,
	ID_GotoIfNot = 25,
	ID_CellTimeOverWrite = 26,
	ID_ActionRequest = 27,
	ID_ActionRequestNotSame = 28,
	ID_ActionRequestOld2New = 29,
	ID_IfBeginCharaName = 30,
	ID_GotoForLoop = 31,
	ID_DeleteObjectActionName = 32,
	ID_SearchActionName = 33,
	ID_InterruptAction = 34,
	ID_InterruptGoto = 35,
	ID_InterruptParam0 = 36,
	ID_InterruptParam1 = 37,
	ID_DeleteObjectActionNameNotSelf = 38,
	ID_IfTiming = 39,
	ID_ControlObjectEnd = 40,
	ID_ControlObject = 41,
	ID_StackControlObjectEx = 42,
	ID_StackControlObject = 43,
	ID_Op1 = 44,
	ID_Op2 = 45,
	ID_OpCopy = 46,
	ID_CheckEnemyName = 47,
	ID_CheckInputEx = 48,
	ID_CheckConditionEx = 49,
	ID_CalcRound = 50,
	ID_CheckActive = 51,
	ID_Op2To = 52,
	ID_OpCopyEx = 53,
	ID_Op2Direct = 54,
	ID_CheckStop = 55,
	ID_CellStop = 56,
	ID_ObjectPriority = 57,
	ID_WorldOutToEliminate = 58,
	ID_GetTrainingItemVal = 59,

	ID_DramaticActionRoundStart = 2507,
	ID_DramaticCondition = 2508,
	ID_DramaticSetClear = 2509,
	ID_DispDramaticFinish = 2510,
	ID_StartHUDTutorial = 2511,
	ID_InitCharNameFromCharaID = 2512,
	ID_IfBeginCharaID = 2513,
	ID_InitCharNameForVoice = 2514,
	ID_SetVoiceCharNameFromCharaID = 2515,
	ID_SetMeteoUltimateSkillOffset = 2516,
	ID_RequestBattleLiveMeteoSkill = 2517,
	ID_PlayAnimeFaceIndex = 2518,
	ID_IgnoreDispOnlyMe = 2519,
	ID_ZLineNearScale = 2520,
	ID_ResetZLineNearScale = 2521,
	ID_BoneControl_IgnoreObjStop = 2522,
	ID_BoneControl_Position = 2523,
	ID_BoneControl_Rotation = 2524,
	ID_IgnoreZLine = 2525,
	ID_CellSlowParam = 2526,
	ID_CellSlowDefaultParam = 2527,
	ID_MoveCamera_Start = 2528,
	ID_MoveCamera_BasePosObject = 2529,
	ID_MoveCamera_TargetPosObject = 2530,
	ID_MoveCamera_PosX = 2531,
	ID_MoveCamera_PosY = 2532,
	ID_MoveCamera_PosZ = 2533,
	ID_MoveCamera_RotPitch = 2534,
	ID_MoveCamera_RotYaw = 2535,
	ID_MoveCamera_RotRoll = 2536,
	ID_MoveCamera_BasePosOffsetX = 2537,
	ID_MoveCamera_BasePosOffsetY = 2538,
	ID_MoveCamera_BasePosOffsetZ = 2539,
	ID_MoveCamera_TargetPosOffsetX = 2540,
	ID_MoveCamera_TargetPosOffsetY = 2541,
	ID_MoveCamera_TargetPosOffsetZ = 2542,
	ID_MoveCamera_TargetDistance = 2543,
	ID_MoveCamera_TargetPercent = 2544,
	ID_MoveCamera_FOV = 2545,
	ID_MoveCamera_TargetRotRatePitch = 2546,
	ID_MoveCamera_TargetRotRateYaw = 2547,
	ID_MoveCamera_TargetRotRateRoll = 2548,
	ID_MoveCamera_Pos = 2549,
	ID_MoveCamera_Rot = 2550,
	ID_MoveCamera_BasePosOffset = 2551,
	ID_MoveCamera_TargetPosOffset = 2552,
	ID_MoveCamera_TargetRotRate = 2553,
	ID_MoveCamera_Reset = 2554,
	ID_MoveCamera_TargetPosRateX = 2555,
	ID_MoveCamera_TargetPosRateY = 2556,
	ID_MoveCamera_TargetPosRateZ = 2557,
	ID_MoveCamera_TargetPosRate = 2558,
	ID_BoneControl_Scale = 2559,
	ID_Cinesco = 2560,
	ID_MoveCamera_TargetCameraOn = 2561,
	ID_MoveCamera_TargetCameraOff = 2562,
	ID_MoveCamera_TargetCameraOn_Blend = 2563,
	ID_MoveCamera_TargetCameraOff_Blend = 2564,
	ID_MoveCamera_Stop = 2565,
	ID_MoveCamera_TargetRotRoll = 2566,
	ID_MoveCamera_Anime = 2567,
	ID_MoveCamera_AnimePosRate = 2568,
	ID_MoveCamera_AnimeRotRate = 2569,
	ID_MoveCamera_AnimeFOVRate = 2570,
	ID_CenterScreenPosition = 2571,
	ID_MoveCamera_Spline = 2572,
	ID_MoveCamera_SplinePosRate = 2573,
	ID_MoveCamera_TrackUp = 2574,
	ID_MoveCamera_OrthoCurve = 2575,
	ID_SetCmnMaterialDefaultVal = 2576,
	ID_PauseCmnMaterialParam = 2577,
	ID_SetCmnMaterialResetOnActionChange = 2578,
	ID_SetStatusIcon = 2579,
	ID_DispWithoutMove = 2580,
	ID_OverwriteLinkBone = 2581,
	ID_ResetOverwriteLinkBone = 2582,
	ID_LockMesh = 2583,
	ID_UnlockMesh = 2584,
	ID_AttachPawn = 2585,
	ID_DetachPawn = 2586,
	ID_ParticleSlow = 2587,
	ID_ColorAreaBlend = 2588,
	ID_PostProcessEffect = 2589,
	ID_SceneLightDir = 2590,
	ID_CellSlowParamFinishStop = 2591,
	ID_CameraLightDirBlend = 2592,
	ID_SlowMoveRate = 2593,
	ID_SetStatisticsCheckSkill = 2594,
	ID_StatisticsActionName = 2595,
};

extern const int BeginEndList[17][2];
extern const uint16_t commandSizeTable[2596];

struct sActionBegin
{
	CXXBYTE<32> m_ActionName; // 0x0
	uint32_t m_OffsetAddr; // 0x20
	sActionBegin();
};

enum INTERRUPT_FLAG
{
	INTERRUPT_FLAG_NULL = 0,
	INTERRUPT_FLAG_TEMP_IGNORE = 1,
};

class CInterruptInfo
{
public:
	CInterruptInfo();
	void InitCInterruptInfo();
	unsigned char* m_BeginAddr; // 0x0
	CXXBYTE<32> m_ActionName; // 0x8
	int32_t m_IIParam0; // 0x28
	int32_t m_IIParam1; // 0x2C
	CXXBYTE<32> m_GotoLabel; // 0x30
	uint32_t m_IntFlg; // 0x50
};

enum INTERRUPT_PARAM
{
	INTERRUPT_PARAM_BEGINADDR = 0,
	INTERRUPT_PARAM_ACTIONNAME = 1,
	INTERRUPT_PARAM_GOTOLABEL = 2,
	INTERRUPT_PARAM_IIPARAM0 = 3,
	INTERRUPT_PARAM_IIPARAM1 = 4,
	INTERRUPT_PARAM_MAX = 5,
};

class CActionRequestInfo
{
public:
	CActionRequestInfo() {}
	void CActionRequestInfoInit()
	{
		m_RequestName = "";
		m_RequestFlag = 0;
		m_RequestGotoLabel = "";
		m_RequestSkillID = -1;
		m_SomeSkillIsRequested = false;
		m_SomeSkillIsRequestReserved = false;
		m_RequestGCSkill = -1;
	}
	CXXBYTE<32> m_RequestName; // 0x0
	uint32_t m_RequestFlag; // 0x20
	CXXBYTE<32> m_RequestGotoLabel; // 0x24
	int32_t m_RequestSkillID; // 0x44
	bool m_SomeSkillIsRequested; // 0x48
	bool m_SomeSkillIsRequestReserved; // 0x49
	int32_t m_RequestGCSkill; // 0x4C
};

class CBBSFileAnalyzeData
{
public:
	CBBSFileAnalyzeData()
	{
		m_ActIndexTable = nullptr;
		m_FuncAddrTable = nullptr;
		m_PreFuncAddrTable = nullptr;
		m_PostFuncAddrTable = nullptr;
		m_bAllocate = false;
	}
	~CBBSFileAnalyzeData()
	{
		ReleaseHashTable();
	}
	void AllocateHashTable(uint32_t actNum, uint32_t funcNum)
	{
		if (actNum)
		{
			m_ActIndexTable = std::make_shared<CHashTable<CHashNodeC32BYTEtoU32>>(actNum);
		}
		if (funcNum)
		{
			m_FuncAddrTable = std::make_shared<CHashTable<CHashNodeC32BYTEtoU32>>(funcNum);
			m_PreFuncAddrTable = std::make_shared<CHashTable<CHashNodeC32BYTEtoU32>>(funcNum);
			m_PostFuncAddrTable = std::make_shared<CHashTable<CHashNodeC32BYTEtoU32>>(funcNum);
		}
		m_bAllocate = true;
	}
	void ReleaseHashTable()
	{
		if (m_bAllocate)
		{
			m_ActIndexTable = nullptr;
			m_FuncAddrTable = nullptr;
			m_PreFuncAddrTable = nullptr;
			m_PostFuncAddrTable = nullptr;
		}
	}
	unsigned char* m_DataTopAddr; // 0x0
	unsigned char* m_ScriptTopAddr; // 0x8
	int32_t m_ActionBeginCount; // 0x10
	sActionBegin* m_ActionBeginListAddr; // 0x18
	std::shared_ptr<CHashTable<CHashNodeC32BYTEtoU32>> m_ActIndexTable; // 0x20
	std::shared_ptr<CHashTable<CHashNodeC32BYTEtoU32>> m_FuncAddrTable; // 0x30
	std::shared_ptr<CHashTable<CHashNodeC32BYTEtoU32>> m_PreFuncAddrTable; // 0x40
	std::shared_ptr<CHashTable<CHashNodeC32BYTEtoU32>> m_PostFuncAddrTable; // 0x50
	bool m_bAllocate; // 0x60
	void BBSAnalyzeExe(unsigned char* addr, uint32_t size);
	unsigned char* GetFuncAddrBase(const CXXBYTE<32>& funcName, CHashTable<CHashNodeC32BYTEtoU32>* pTable);
	unsigned char* GetGotoAddrBBSF(unsigned char* curActionTop, const CXXBYTE<32>& gotoLabel);
};